Revit 2026 API

# NumberingSchemaTypes Class

---

Provides a container of all Revit built-in NumberingSchemaType instances.

SystemObject Autodesk.Revit.DBNumberingSchemaTypes

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class NumberingSchemaTypes
```
```vb
Public NotInheritable Class NumberingSchemaTypes
```
```cpp
public ref class NumberingSchemaTypes abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type NumberingSchemaTypes = class end
```

#### Reference

Autodesk.Revit.DB Namespace